/*******************************************************************************
* タイトル:		評価課題 RPGゲーム
* プログラム名:	battle_1.h
* 作成者:		GP11B-341 29 益子　聖渚
* 作成日:		2018/06/08
*******************************************************************************/

/*******************************************************************************
* main.h	メインヘッダーファイル
*******************************************************************************/
#ifndef	BATTLE_1_H
#define	BATTLE_1_H

/*******************************************************************************
* scanf のwarning防止
*******************************************************************************/
#define _CRT_SECURE_NO_WARNINGS

/*******************************************************************************
* インクルードファイル
*******************************************************************************/

/*******************************************************************************
* マクロ定義
*******************************************************************************/




/*******************************************************************************
* 構造体定義
*******************************************************************************/


/*******************************************************************************
* プロトタイプ宣言
*******************************************************************************/

void Battle_Wolf(void);						//狼との戦闘プログラム
void Battle_Slime(void);					//スライムとの戦闘プログラム
void Battle_Knight(void);					//ナイトとの戦闘プログラム
void Battle_Dragon(void);					//ドラゴンとの戦闘プログラム
void Battle_Boss(void);						//ボスとの戦闘プログラム
void DrawBattleDisplay(void);			    // バトルディスプレイの表示

void BattleDisplay_arrow(void);          // アローの初期化処理
void DrawBattleDisplayBG(void);          // BG描画 (背景描画)
void UpdateBattleDisplay_arrow(void);    // アローの更新処理
void DrawBattleDisplayArrow(void);	     // アローを描画する為に位置をセット
void SelectCommand(void);				 // コマンド選択の処理プログラム


#endif
